app/views/project_to_skills/new.html.haml

    What skills are you looking for?
  - @project.get_skills.each do |e|
    .ability
---
SELECT "skills".* FROM "skills"