app/views/applications/myapplications.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1
---
      <h3 class="project-quick-title">
      	<%= @users.find(app.user_id).name %>