app/views/user_to_skills/new.html.haml

SELECT "skills".* FROM "skills"
SELECT "user_to_skills".* FROM "user_to_skills" WHERE "user_to_skills"."user_id" = 1
---
    Check out them skills!
  - current_user.user_to_skills.each do |e|
    .ability