app/views/users/show.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    .span3
      = image_tag avatar_url(User.find(params[:id]),300)

SELECT "user_to_skills".* FROM "user_to_skills" WHERE "user_to_skills"."user_id" IN (1)
---
                %span
                  - @user.user_to_skills.each do |i|