app/views/home/index.html.haml

SELECT "skills".* FROM "skills" INNER JOIN "user_to_skills" ON "skills"."id" = "user_to_skills"."skill_id" WHERE "user_to_skills"."user_id" = 1
---
- if user_signed_in? && current_user.skills.blank?
  .alert.alert-info

SELECT "interests".* FROM "interests" INNER JOIN "user_to_interests" ON "interests"."id" = "user_to_interests"."interest_id" WHERE "user_to_interests"."user_id" = 1
---
    to fill out your skills!
- if user_signed_in? && current_user.interests.blank?
  .alert.alert-warning