app/views/user_to_interests/new.html.haml

    Tell us your interests!
  - current_user.user_to_interests.each do |e|
    .ability
---
SELECT "interests".* FROM "interests"
SELECT "user_to_interests".* FROM "user_to_interests" WHERE "user_to_interests"."user_id" = 1