app/views/projects/candidates.html.haml

SELECT "user_to_skills".* FROM "user_to_skills" WHERE "user_to_skills"."user_id" = 2
SELECT "users".* FROM "users" ORDER BY weight DESC
---
      .span2
        - u.user_to_skills.each do |s|

SELECT "user_to_interests".* FROM "user_to_interests" WHERE "user_to_interests"."user_id" = 1
---
            %br
      - u.user_to_interests.each do |i|