app/views/projects/new.html.haml

        Category
      = f.input :category, :as => :select, :collection => Interest.all, :input_html => { :class => "chzn-select" }
---
SELECT "interests".* FROM "interests"