app/controllers/applications_controller.rb

  def new
    @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "7"]]

  def create
    @application = Application.new(params[:application])
    if @application.save then
---
INSERT INTO "applications" ("created_at", "message", "project_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 27 Jan 2013 21:17:20 UTC +00:00], ["message", "Im goo"], ["project_id", 7], ["updated_at", Sun, 27 Jan 2013 21:17:20 UTC +00:00], ["user_id", 27]]

  def myapplications
    ids = current_user.projects.pluck(:id)
    test = []
    apps = Application.all
    apps.each do |a|
      if ids.include?(a.project_id)
        test << a
      end
    end
    @applications = test

    ids = []
    @applications.each do |a|
      ids << a.user_id
    end
    @users = User.where(:id => ids)
---
SELECT id FROM "projects" WHERE "projects"."user_id" = 6
SELECT "applications".* FROM "applications"
SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1