app/controllers/project_to_skills_controller.rb

  def new
    @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @project = Project.find(params[:project_to_skill][:project_id])
    @skill = ProjectToSkill.new(params[:project_to_skill])
    @skill.save
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "project_to_skills" ("created_at", "project_id", "skill_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 27 Jan 2013 17:39:36 UTC +00:00], ["project_id", 1], ["skill_id", 11], ["updated_at", Sun, 27 Jan 2013 17:39:36 UTC +00:00]]