app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY weight DESC
---
  def index
    projects = Project.all

INSERT INTO "projects" ("category", "created_at", "description", "short_description", "skills", "title", "updated_at", "user_id", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @project = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 2 ORDER BY weight DESC
---
  def myprojects
    @projects = Project.order("weight DESC").where(:user_id => current_user.id)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" ORDER BY weight DESC
---
  def candidates
    @project = Project.find(params[:project_id])
    users = User.all