app/controllers/user_to_interests_controller.rb

INSERT INTO "user_to_interests" ("created_at", "interest_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 27 Jan 2013 17:38:23 UTC +00:00], ["interest_id", 2], ["updated_at", Sun, 27 Jan 2013 17:38:23 UTC +00:00], ["user_id", 2]]
---
  def create
    @interest = UserToInterest.new(params[:user_to_interest])
    @interest.save