app/controllers/user_to_skills_controller.rb

  def create
    @skill = UserToSkill.new(params[:user_to_skill])
    @skill.save
---
INSERT INTO "user_to_skills" ("created_at", "level", "skill_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 27 Jan 2013 17:37:29 UTC +00:00], ["level", 7], ["skill_id", 11], ["updated_at", Sun, 27 Jan 2013 17:37:29 UTC +00:00], ["user_id", 2]]