app/controllers/users_controller.rb

SELECT "interests".* FROM "interests" WHERE "interests"."id" IN (2, 3, 6, 7)
SELECT "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT 1  [["id", 11]]
SELECT "user_to_interests".* FROM "user_to_interests" WHERE "user_to_interests"."user_id" IN (1)
SELECT "user_to_skills".* FROM "user_to_skills" WHERE "user_to_skills"."user_id" IN (1)
---
  def show
    @user = User.includes(:user_to_skills, :user_to_interests, :interests).find(params[:id])